tests/jmeter/out/html/statistics.json
{
  "GET http://localhost:8080/health" : {
    "transaction" : "GET http://localhost:8080/health",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 1.1600000000000004,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 17.0,
    "throughput" : 1.7044486108743822,
    "receivedKBytesPerSec" : 4.449210094596898,
    "sentKBytesPerSec" : 0.0
  },
  "GET http://localhost:8080/api/products" : {
    "transaction" : "GET http://localhost:8080/api/products",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 0.5999999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 1.705495105229048,
    "receivedKBytesPerSec" : 4.451941812770747,
    "sentKBytesPerSec" : 0.0
  },
  "GET http://localhost:8080/api/orders" : {
    "transaction" : "GET http://localhost:8080/api/orders",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 0.64,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.7055532814845136,
    "receivedKBytesPerSec" : 4.452093673250102,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 150,
    "errorCount" : 150,
    "errorPct" : 100.0,
    "meanResTime" : 0.7999999999999998,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 9.350000000000136,
    "throughput" : 5.113171529860922,
    "receivedKBytesPerSec" : 13.347175292302973,
    "sentKBytesPerSec" : 0.0
  }
}