tests/jmeter/out/html_backend/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2000,
    "errorCount" : 2000,
    "errorPct" : 100.0,
    "meanResTime" : 2.0585000000000013,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.990000000000009,
    "throughput" : 33.46496218459273,
    "receivedKBytesPerSec" : 11.470900123820359,
    "sentKBytesPerSec" : 4.0850783916739175
  },
  "GET http://host.docker.internal:8084/" : {
    "transaction" : "GET http://host.docker.internal:8084/",
    "sampleCount" : 2000,
    "errorCount" : 2000,
    "errorPct" : 100.0,
    "meanResTime" : 2.0585000000000013,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.990000000000009,
    "throughput" : 33.46496218459273,
    "receivedKBytesPerSec" : 11.470900123820359,
    "sentKBytesPerSec" : 4.0850783916739175
  }
}