tests/jmeter/out/html_frontend/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.4833333333333345,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 37.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 5.0576572931418164,
    "receivedKBytesPerSec" : 28.755547617843412,
    "sentKBytesPerSec" : 0.6173898062917257
  },
  "GET http://host.docker.internal:4302/" : {
    "transaction" : "GET http://host.docker.internal:4302/",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.4833333333333345,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 37.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 5.0576572931418164,
    "receivedKBytesPerSec" : 28.755547617843412,
    "sentKBytesPerSec" : 0.6173898062917257
  }
}